load-test/k6/results/test-2-for-2-min-ingestion-20-vus/insert-app_py_fastapi_uvicorn.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _py_fastapi_uvicorn............: avg=34.67441 min=18.769  med=28.979  max=755.422  p(90)=42.258  p(95)=56.26475
     data_received..................: 12 MB 97 kB/s
     data_sent......................: 14 MB 116 kB/s
     http_req_blocked...............: avg=3.44µs   min=1µs     med=2µs     max=2.34ms   p(90)=3µs     p(95)=4µs
     http_req_connecting............: avg=426ns    min=0s      med=0s      max=816µs    p(90)=0s      p(95)=0s
     http_req_duration..............: avg=34.73ms  min=18.83ms med=29.04ms max=755.48ms p(90)=42.34ms p(95)=56.37ms
       { expected_response:true }...: avg=34.73ms  min=18.83ms med=29.04ms max=755.48ms p(90)=42.34ms p(95)=56.37ms
     http_req_failed................: 0.00% ✓ 0          ✗ 68706
     http_req_receiving.............: avg=46.65µs  min=15µs    med=42µs    max=14.11ms  p(90)=68µs    p(95)=80µs
     http_req_sending...............: avg=18.23µs  min=6µs     med=16µs    max=5.31ms   p(90)=24µs    p(95)=30µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=34.67ms  min=18.76ms med=28.97ms max=755.42ms p(90)=42.25ms p(95)=56.26ms
     http_reqs......................: 68706 572.479103/s
     iteration_duration.............: avg=34.92ms  min=19ms    med=29.2ms  max=755.81ms p(90)=42.57ms p(95)=56.65ms
     iterations.....................: 68706 572.479103/s
     vus............................: 20    min=20       max=20
     vus_max........................: 20    min=20       max=20


running (2m00.0s), 00/20 VUs, 68706 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s